---
kind: type
id: T:Autodesk.Revit.DB.Visual.Water
source: html/4effcb07-3353-7d1e-1976-b43dbc1f4067.htm
---
# Autodesk.Revit.DB.Visual.Water

A static class that provides access to the property names that appear in the Water visual asset schema.

## Syntax (C#)
```csharp
public static class Water
```